Tekla Open API Reference for Tekla Structures 2025
Vector.GetNormal Method
 Returns a new normalized equivalent of the current vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector GetNormal()
Public Function GetNormal As Vector
Return Value
Type: Vector
The normalized equivalent of the current vector.
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace